RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S28/LPC55S28/drivers/fsl_hashcrypt.c
    if (outputSize > sizeof(digest))
    {
        outputSize = sizeof(digest);
    }
    (void)hashcrypt_memcpy(output, digest, outputSize);
}

/*!
 * @brief Initialize the Hashcrypt engine for new operation.
 *
 * This function sets NEW and MODE fields in Hashcrypt Control register to start new operation.
 *
 * @param base Hashcrypt peripheral base address.
 * @param hashcrypt_algo_t Internal context.
 */
static void hashcrypt_engine_init(HASHCRYPT_Type *base, hashcrypt_algo_t algo)
{
    /* NEW bit must be set before we switch from previous mode otherwise new mode will not work correctly */
    base->CTRL = HASHCRYPT_CTRL_NEW_HASH(1);
    base->CTRL = HASHCRYPT_CTRL_MODE(algo) | HASHCRYPT_CTRL_NEW_HASH(1);
}

/*!
 * @brief Deinitialization of the Hashcrypt engine.
 *
 * This function sets MODE field in Hashcrypt Control register to zero - disabled.
 * This reduces power consumption of HASHCRYPT.
 *
 * @param base Hashcrypt peripheral base address.
 */
static inline void hashcrypt_engine_deinit(HASHCRYPT_Type *base)
{
    base->CTRL &= ~(HASHCRYPT_CTRL_MODE_MASK);
}

/*!
 * @brief Loads user key to INDATA register.
 *
 * This function writes user key stored in handle into HashCrypt INDATA register.
 *
 * @param base Hashcrypt peripheral base address.
 * @param handle Handle used for this request.
 */
static void hashcrypt_aes_load_userKey(HASHCRYPT_Type *base, hashcrypt_handle_t *handle)
{
    size_t keySize = 0;

    switch (handle->keySize)
    {
        case kHASHCRYPT_Aes128:
            keySize = 16;
            break;
        case kHASHCRYPT_Aes192:
            keySize = 24;
            break;
        case kHASHCRYPT_Aes256:
            keySize = 32;
            break;
        default:
            /* All the cases have been listed above, the default clause should not be reached. */
            break;
    }
    if (keySize == 0U)
    {
        return;
    }
    hashcrypt_load_data(base, &handle->keyWord[0], keySize);
}

/*!
 * @brief Performs AES encryption/decryption of one data block.
 *
 * This function encrypts/decrypts one block of data with specified size.
 *
 * @param base Hashcrypt peripheral base address.
 * @param input input data
 * @param output output data
 * @param size size of data block to process in bytes (must be 16bytes multiple).
 */
static status_t hashcrypt_aes_one_block_aligned(HASHCRYPT_Type *base,
                                                const uint8_t *input,
                                                uint8_t *output,
                                                size_t size)
{
    status_t status = kStatus_Fail;
    uint32_t idx    = 0;

    base->MEMADDR = HASHCRYPT_MEMADDR_BASE(input);
    base->MEMCTRL = HASHCRYPT_MEMCTRL_MASTER(1) | HASHCRYPT_MEMCTRL_COUNT(size / 16U);
    while (size >= HASHCRYPT_AES_BLOCK_SIZE)
    {
        /* Get result */
        while (0U == (base->STATUS & HASHCRYPT_STATUS_DIGEST_MASK))
        {
        }

        for (int i = 0; i < 4; i++)
        {
            ((uint32_t *)(uintptr_t)output + idx)[i] = swap_bytes(base->DIGEST0[i]);
        }

        idx += HASHCRYPT_AES_BLOCK_SIZE / 4U;
        size -= HASHCRYPT_AES_BLOCK_SIZE;
    }

    if (0U == (base->STATUS & HASHCRYPT_STATUS_ERROR_MASK))
    {
        status = kStatus_Success;
    }

    return status;
}

/*!
 * @brief Performs AES encryption/decryption of one data block.
 *
 * This function encrypts/decrypts one block of data with specified size.
 *
 * @param base Hashcrypt peripheral base address.
 * @param input input data
 * @param output output data
 * @param size size of data block to process in bytes (must be 16bytes multiple).
 */
static status_t hashcrypt_aes_one_block_unaligned(HASHCRYPT_Type *base,
                                                  const uint8_t *input,
                                                  uint8_t *output,
                                                  size_t size)
{
    status_t status = kStatus_Fail;

    /* we use AHB master mode as much as possible */
    /* however, it can work only with aligned input data */
    /* so, if unaligned, we do memcpy to temp buffer on stack, which is aligned, and use AHB mode to read data in */
    /* then we read data back to it and do memcpy to the output buffer */
    uint32_t temp[256 / sizeof(uint32_t)];
    int cnt = 0;
    while (size != 0U)
    {
        size_t actSz     = size >= 256u ? 256u : size;
        size_t actSzOrig = actSz;
        (void)memcpy(temp, (const uint32_t *)(uintptr_t)(input + 256 * cnt), actSz);
        size -= actSz;
        base->MEMADDR   = HASHCRYPT_MEMADDR_BASE(temp);
        base->MEMCTRL   = HASHCRYPT_MEMCTRL_MASTER(1) | HASHCRYPT_MEMCTRL_COUNT(actSz / 16U);
        uint32_t outidx = 0;
        while (actSz != 0U)
        {
            while (0U == (base->STATUS & HASHCRYPT_STATUS_DIGEST_MASK))
            {
            }
            for (int i = 0; i < 4; i++)
            {
                (temp + outidx)[i] = swap_bytes(base->DIGEST0[i]);
            }
            outidx += HASHCRYPT_AES_BLOCK_SIZE / 4U;
            actSz -= HASHCRYPT_AES_BLOCK_SIZE;
        }
        (void)memcpy(output + 256 * cnt, (const uint8_t *)(uintptr_t)temp, actSzOrig);
        cnt++;
    }

    if (0U == (base->STATUS & HASHCRYPT_STATUS_ERROR_MASK))
    {
        status = kStatus_Success;
    }

    return status;
}

/*!
 * @brief Performs AES encryption/decryption of one data block.
 *
 * This function encrypts/decrypts one block of data with specified size.
 *
 * @param base Hashcrypt peripheral base address.
 * @param input input data
 * @param output output data
 * @param size size of data block to process in bytes (must be 16bytes multiple).
 */
static status_t hashcrypt_aes_one_block(HASHCRYPT_Type *base, const uint8_t *input, uint8_t *output, size_t size)
{
    status_t status = kStatus_Fail;

    /*MEMCTRL bitfield for COUNT is 11 bits, and this limits the number of blocks to process in one Master run to 2047
    (2^11 -1)  blocks . Each block is 16bytes long, so biggest data size  which can we do in one Master run is (2047
    blocks *16 bytes) = 32752 So, when size is overflowing HASHCRYPT_MEMCTRL_COUNT field of MEMCTRL register, we split
    our data into more smaller chunks */

