RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S28/LPC55S28/drivers/fsl_hashcrypt.c
    /* in case of HW AES key, check if it is available */
    if (hashcrypt_check_need_key(base, handle) != kStatus_Success)
    {
        hashcrypt_engine_deinit(base);
        return kStatus_Fail;
    }

    /* load key if kHASHCRYPT_UserKey is selected */
    if (handle->keyType == kHASHCRYPT_UserKey)
    {
        hashcrypt_aes_load_userKey(base, handle);
    }

    /* load nonce */
    hashcrypt_load_data(base, (uint32_t *)(uintptr_t)counter, 16);

    lastSize = size % HASHCRYPT_AES_BLOCK_SIZE;
    size -= lastSize;

    /* encrypt full 16byte blocks */
    status = hashcrypt_aes_one_block(base, input, output, size);
    if (status != kStatus_Success)
    {
        hashcrypt_engine_deinit(base);
        return status;
    }

    while (size != 0U)
    {
        ctrIncrement(counter);
        size -= 16u;
        input += 16;
        output += 16;
    }

    if (lastSize != 0U)
    {
        if (counterlast != NULL)
        {
            lastEncryptedCounter = counterlast;
        }
        else
        {
            lastEncryptedCounter = lastBlock;
        }

        /* Perform encryption with all zeros to get last counter. XOR with zeros doesn't change. */
        status = hashcrypt_aes_one_block(base, lastBlock, lastEncryptedCounter, HASHCRYPT_AES_BLOCK_SIZE);
        if (status != kStatus_Success)
        {
            hashcrypt_engine_deinit(base);
            return status;
        }
        /* remain output = input XOR counterlast */
        for (uint32_t i = 0; i < lastSize; i++)
        {
            output[i] = input[i] ^ lastEncryptedCounter[i];
        }
        /* Increment counter parameter */
        ctrIncrement(counter);
    }
    else
    {
        lastSize = HASHCRYPT_AES_BLOCK_SIZE;
        /* no remaining bytes in couterlast so clearing it */
        if (counterlast != NULL)
        {
            (void)memset(counterlast, 0, HASHCRYPT_AES_BLOCK_SIZE);
        }
    }

    if (szLeft != NULL)
    {
        *szLeft = HASHCRYPT_AES_BLOCK_SIZE - lastSize;
    }

    /* After processing all data, hashcrypt engine is set to disabled to lower power consumption */
    hashcrypt_engine_deinit(base);
    return kStatus_Success;
}

status_t HASHCRYPT_AES_CryptOfb(HASHCRYPT_Type *base,
                                hashcrypt_handle_t *handle,
                                const uint8_t *input,
                                uint8_t *output,
                                size_t size,
                                const uint8_t iv[HASHCRYPT_AES_BLOCK_SIZE])
{
    status_t status                               = kStatus_Fail;
    uint8_t zeroes[HASHCRYPT_AES_BLOCK_SIZE]      = {0};
    uint8_t blockOutput[HASHCRYPT_AES_BLOCK_SIZE] = {0};

    if (handle->keySize == kHASHCRYPT_InvalidKey)
    {
        return kStatus_InvalidArgument;
    }

    uint32_t keyType = (handle->keyType == kHASHCRYPT_UserKey) ? 0U : 1u;

    base->CRYPTCFG = HASHCRYPT_CRYPTCFG_AESMODE(kHASHCRYPT_AesCbc) | HASHCRYPT_CRYPTCFG_AESDECRYPT(AES_ENCRYPT) |
                     HASHCRYPT_CRYPTCFG_AESSECRET(keyType) | HASHCRYPT_CRYPTCFG_AESKEYSZ(handle->keySize) |
                     HASHCRYPT_CRYPTCFG_MSW1ST_OUT(1) | HASHCRYPT_CRYPTCFG_SWAPKEY(1) | HASHCRYPT_CRYPTCFG_SWAPDAT(1) |
                     HASHCRYPT_CRYPTCFG_MSW1ST(1);

    hashcrypt_engine_init(base, kHASHCRYPT_Aes);

    /* in case of HW AES key, check if it is available */
    if (hashcrypt_check_need_key(base, handle) != kStatus_Success)
    {
        hashcrypt_engine_deinit(base);
        return kStatus_Fail;
    }

    /* load key if kHASHCRYPT_UserKey is selected */
    if (handle->keyType == kHASHCRYPT_UserKey)
    {
        hashcrypt_aes_load_userKey(base, handle);
    }

    /* load iv */
    hashcrypt_load_data(base, (uint32_t *)(uintptr_t)iv, HASHCRYPT_AES_BLOCK_SIZE);

    /*Use AES CBC mode and feed input with zeroes as input*/
    /*Output block is then XORed with input*/

    while (size >= 16u)
    {
        status = hashcrypt_aes_one_block(base, zeroes, blockOutput, HASHCRYPT_AES_BLOCK_SIZE);
        if (status != kStatus_Success)
        {
            hashcrypt_engine_deinit(base);
            return status;
        }
        /* XOR input with output block to get output*/
        for (uint32_t i = 0; i < HASHCRYPT_AES_BLOCK_SIZE; i++)
        {
            output[i] = input[i] ^ blockOutput[i];
        }
        size -= 16u;
        output += 16;
        input += 16;
    }

    /* OFB can have non-block multiple size.*/
    if (size != 0U)
    {
        status = hashcrypt_aes_one_block(base, zeroes, blockOutput, HASHCRYPT_AES_BLOCK_SIZE);
        if (status != kStatus_Success)
        {
            hashcrypt_engine_deinit(base);
            return status;
        }

        /* XOR input with output block to get output*/
        for (uint32_t i = 0; i < size; i++)
        {
            output[i] = input[i] ^ blockOutput[i];
        }
    }

    /* After processing all data, hashcrypt engine is set to disabled to lower power consumption */
    hashcrypt_engine_deinit(base);
    return status;
}

status_t HASHCRYPT_AES_EncryptCfb(HASHCRYPT_Type *base,
                                  hashcrypt_handle_t *handle,
                                  const uint8_t *plaintext,
                                  uint8_t *ciphertext,
                                  size_t size,
                                  const uint8_t iv[HASHCRYPT_AES_BLOCK_SIZE])
{
    status_t status                               = kStatus_Fail;
    uint8_t zeroes[HASHCRYPT_AES_BLOCK_SIZE]      = {0};
    uint8_t blockOutput[HASHCRYPT_AES_BLOCK_SIZE] = {0};

    /* For CFB mode size must be 16-byte multiple */
    if ((0U != (size % 16u)) || (handle->keySize == kHASHCRYPT_InvalidKey))
    {
        return kStatus_InvalidArgument;
    }

    uint32_t keyType = (handle->keyType == kHASHCRYPT_UserKey) ? 0U : 1u;

    base->CRYPTCFG = HASHCRYPT_CRYPTCFG_AESMODE(kHASHCRYPT_AesCbc) | HASHCRYPT_CRYPTCFG_AESDECRYPT(AES_ENCRYPT) |
                     HASHCRYPT_CRYPTCFG_AESSECRET(keyType) | HASHCRYPT_CRYPTCFG_AESKEYSZ(handle->keySize) |
                     HASHCRYPT_CRYPTCFG_MSW1ST_OUT(1) | HASHCRYPT_CRYPTCFG_SWAPKEY(1) | HASHCRYPT_CRYPTCFG_SWAPDAT(1) |
                     HASHCRYPT_CRYPTCFG_MSW1ST(1);

    hashcrypt_engine_init(base, kHASHCRYPT_Aes);

